org/lisp/notes/scheme-on-mac.org
#+DATE: 1 August 2021

#+TITLE: Running Scheme on Mac

This is a quick note on how to run MIT Scheme on Mac.
First get MIT Scheme via Homebrew:

#+begin_src pseudo

$ brew install mit-scheme

#+end_src

Then you need to get your path variables (refer last string below)

#+begin_src

$ mit-scheme --help

This machine accepts the following command-line options.  The options
may appear in any order, but they must all appear before any options
for the band.

--library PATH
  Sets the library search path to PATH.  This is a colon-separated
  list of directories that is searched to find various library files,
  such as bands.  If this option is not given, the value of the
  environment variable MITSCHEME_LIBRARY_PATH is used; if that isn't
  defined, "/usr/local/Cellar/mit-scheme/11.2/lib/mit-scheme-x86-64-11.2" is used.

...

#+end_src

Then add the following to your =.emacs=, noting that you may need to
play around with =M-x Customize-Group RET Scheme= (check the various
SO questions online), but I think its enough:

#+begin_src lisp

(require 'xscheme)

(setq scheme-program-name "/usr/local/Cellar/mit-scheme/11.2/bin/mit-scheme
-library /usr/local/Cellar/mit-scheme/11.2/lib/mit-scheme-x86-64-11.2")

#+end_src

Note how you need to figure out what are the variables to use for you in
the above based on the earlier =--help== command.

Finally, you can run a REPL via =M-x scheme= and also work from =.scm=
files, with the usual commands for loading / compiling (or at least search
online for what they are - C-x C-e works for me).

Enjoy!
