lisp/notes/scheme-on-mac.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-02 Thu 20:33 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Running Scheme on Mac</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="https://www.akhanna.net"> HOME </a>
</div><div id="preamble" class="status">
<div id="logo"><a href="https://www.akhanna.net"Ashok Khanna</a></div>
</div>
<div id="content">
<h1 class="title">Running Scheme on Mac</h1>
<p>
This is a quick note on how to run MIT Scheme on Mac.
First get MIT Scheme via Homebrew:
</p>

<div class="org-src-container">
<pre class="src src-pseudo">
$ brew install mit-scheme

</pre>
</div>

<p>
Then you need to get your path variables (refer last string below)
</p>

<pre class="example">

$ mit-scheme --help

This machine accepts the following command-line options.  The options
may appear in any order, but they must all appear before any options
for the band.

--library PATH
  Sets the library search path to PATH.  This is a colon-separated
  list of directories that is searched to find various library files,
  such as bands.  If this option is not given, the value of the
  environment variable MITSCHEME_LIBRARY_PATH is used; if that isn't
  defined, "/usr/local/Cellar/mit-scheme/11.2/lib/mit-scheme-x86-64-11.2" is used.

...

</pre>

<p>
Then add the following to your <code>.emacs</code>, noting that you may need to
play around with <code>M-x Customize-Group RET Scheme</code> (check the various
SO questions online), but I think its enough:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
(<span style="color: #a020f0;">require</span> '<span style="color: #008b8b;">xscheme</span>)

(setq scheme-program-name <span style="color: #8b2252;">"/usr/local/Cellar/mit-scheme/11.2/bin/mit-scheme</span>
<span style="color: #8b2252;">-library /usr/local/Cellar/mit-scheme/11.2/lib/mit-scheme-x86-64-11.2"</span>)

</pre>
</div>

<p>
Note how you need to figure out what are the variables to use for you in
the above based on the earlier <code>--help=</code> command.
</p>

<p>
Finally, you can run a REPL via <code>M-x scheme</code> and also work from <code>.scm</code>
files, with the usual commands for loading / compiling (or at least search
online for what they are - C-x C-e works for me).
</p>

<p>
Enjoy!
</p>
</div>
<div id="postamble" class="status">
<p class="Date">Last updated: 1 August 2021</p><script src="/scripts/main.js"></script>
</div>
</body>
</html>
